
&НаСервереБезКонтекста
Процедура Отметить(Ссылка)
	Док = Ссылка.ПолучитьОбъект();
	Док.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТекстУстановить(Контрол, Ссылка)
	Контрол.Удалить();
	Если ПустаяСтрока(Ссылка.ТекстСтатьи) Тогда
		Контрол.УстановитьHTML(Ссылка.Описание, Новый Структура);
	Иначе
		Контрол.УстановитьHTML(Ссылка.ТекстСтатьи, Новый Структура);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Отказ = Истина;
	Иначе
		ТекстУстановить(Содержание, Объект);
	КонецЕсли;
	ВремяСтарт	= ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Если НЕ Объект.Проведен И ТекущаяДата() - ВремяСтарт > Регламент.ОтметитьКакПрочтенноеЧерезСек() Тогда
		Отметить(Объект.Ссылка);
		Если ТипЗнч(ВладелецФормы) = Тип("ТаблицаФормы") Тогда
			ВладелецФормы.Обновить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	НаКлиенте.ОткрытьПоСсылке(Объект.Гиперссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ТекстУстановить(Содержание, Параметр);
КонецПроцедуры
