
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//ОтключитьОбработчикОжидания("Обновка");
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		Для Каждого тЭлемент Из ПараметрКоманды Цикл
			ОбработкаКоманды(тЭлемент, ПараметрыВыполненияКоманды);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.Публикация") Тогда
		Если СкачатьПоСсылке(ПараметрКоманды) Тогда
			Оповестить(, ПараметрКоманды);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СкачатьПоСсылке(Ссылка)
	Ответ = Ложь;
	Если (ПустаяСтрока(Ссылка.ТекстСтатьи) Или Ссылка.Проведен)
	И Ссылка.Канал=Справочники.Каналы.Инфостарт И НЕ ПустаяСтрока(Ссылка.Автор) И НЕ ПустаяСтрока(Ссылка.Канал.Гиперссылка)
	Тогда
		Текст = Инфостарт.СкачатьПоСсылке(Ссылка.Канал.Гиперссылка + Ссылка.Номер + "/");
		Если НЕ ПустаяСтрока(Текст) Тогда
			Док = Ссылка.ПолучитьОбъект();
			Док.ТекстСтатьи		= Текст;
			Док.ПометкаУдаления	= Ложь;
			Док.Записать(РежимЗаписиДокумента.Проведение);
			Ответ = Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции
