
&НаСервереБезКонтекста
Функция СкачатьПоСсылке(Ссылка)
	Ответ = Ложь;
	Если ПустаяСтрока(Ссылка.ТекстСтатьи) И Ссылка.Канал = Справочники.Каналы.Инфостарт И НЕ ПустаяСтрока(Ссылка.Канал.Гиперссылка) Тогда
		Текст = Инфостарт.СкачатьПоСсылке(Ссылка.Канал.Гиперссылка + Ссылка.Номер);
		Если НЕ ПустаяСтрока(Текст) Тогда
			Попытка
				Объект = Ссылка.ПолучитьОбъект();
				Объект.ТекстСтатьи	= Текст;
				Объект.Записать(РежимЗаписиДокумента.Проведение);
				Ответ = Истина;
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция ТекстПолучить(Ссылка)
	Ответ = "";
	Если ТипЗнч(Ссылка) = Тип("РегистрСведенийКлючЗаписи.Избранное") Тогда
		Ответ = ?(ПустаяСтрока(Ссылка.Публикация.ТекстСтатьи), Ссылка.Публикация.Описание, Ссылка.Публикация.ТекстСтатьи);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.Публикация") Тогда
		Ответ = ?(ПустаяСтрока(Ссылка.ТекстСтатьи), Ссылка.Описание, Ссылка.ТекстСтатьи);
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Процедура ТекстУстановить(Контрол, Текст="")
	Контрол.Удалить();
	Контрол.УстановитьHTML(Текст, Новый Структура);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Содержание.Вид = ВидПоляФормы.ПолеHTMLДокумента;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		Если Элементы.Содержание.Видимость Тогда
			Если Элемент.ТекущиеДанные = Неопределено Тогда
				Содержание.Удалить();
			ИначеЕсли НЕ Элемент.ТекущиеДанные.Свойство("Публикация") Тогда
				Содержание.Удалить();
			ИначеЕсли Найти(Содержание.ПолучитьТекст(), Лев(Элемент.ТекущиеДанные["Публикация.Описание"], 17)) = 0 Тогда
				ТекстУстановить(Содержание, НаКлиенте.ХТМЛ(ТекстПолучить(Элемент.ТекущаяСтрока)));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВБраузере(Команда)
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		НаКлиенте.ОткрытьПоСсылке(Элементы.Список.ТекущиеДанные.Публикация);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТекстСтатьи(Команда)
	Если Элементы.Список.ТекущиеДанные <> Неопределено И СкачатьПоСсылке(Элементы.Список.ТекущиеДанные.Публикация) Тогда
		ТекстУстановить(Содержание, НаКлиенте.ХТМЛ(ТекстПолучить(Элементы.Список.ТекущиеДанные.Публикация)));
	КонецЕсли;
КонецПроцедуры
