
&НаСервереБезКонтекста
Функция ЭтоТакиДокумент(Знач Ссылка)
	Возврат ТипЗнч(Ссылка) = Тип("РегистрСведенийКлючЗаписи.Избранное")
		Или (ТипЗнч(Ссылка) = Тип("ДанныеФормыСтруктура") И Ссылка.Свойство("Публикация"));
КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(Элемент.ТекущиеДанные)=Тип("ДанныеФормыСтруктура") И Элемент.ТекущиеДанные.Свойство("Публикация") Тогда
		ОткрытьФорму("Документ.Публикация.ФормаОбъекта", Новый Структура("Ключ", Элемент.ТекущиеДанные.Публикация));
	КонецЕсли;
КонецПроцедуры

Функция ТекстПолучить(Ссылка)
	Ответ = "";
	Если ТипЗнч(Ссылка) = Тип("РегистрСведенийКлючЗаписи.Избранное") Тогда
		Ответ = ТекстПолучить(Ссылка.Публикация);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.Публикация") Тогда
		Ответ = ?(ПустаяСтрока(Ссылка.ТекстСтатьи), Ссылка.Описание, Ссылка.ТекстСтатьи);
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Процедура ТекстУстановить(Знач Ссылка)
	Содержание.Удалить();
	Если ЭтоТакиДокумент(Ссылка) Тогда
		Содержание.УстановитьHTML(Инфостарт.Причесать(ТекстПолучить(Ссылка)), Новый Структура);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Содержание.Вид = ВидПоляФормы.ПолеHTMLДокумента;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		Если Элементы.Содержание.Видимость Тогда
			Если Элемент.ТекущиеДанные = Неопределено Тогда
				Содержание.Удалить();
			ИначеЕсли НЕ Элемент.ТекущиеДанные.Свойство("Публикация") Тогда
				Содержание.Удалить();
			ИначеЕсли Найти(Содержание.ПолучитьТекст(), Лев(Элемент.ТекущиеДанные["Публикация.Описание"], 17)) = 0 Тогда
				ТекстУстановить(Элемент.ТекущаяСтрока);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
