
&НаКлиенте
Процедура ВестиПротоколЗагрузкиПриИзменении(Элемент)
	Если НЕ НаборКонстант.ВестиПротоколЗагрузки И НаборКонстант.ВестиПротоколЗагрузкиПодробно Тогда
		НаборКонстант.ВестиПротоколЗагрузкиПодробно = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВестиПротоколЗагрузкиПодробноПриИзменении(Элемент)
	Если НЕ НаборКонстант.ВестиПротоколЗагрузки И НаборКонстант.ВестиПротоколЗагрузкиПодробно Тогда
		НаборКонстант.ВестиПротоколЗагрузки = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьКакПрочтенноеЧерезСекОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка		= Ложь;
	НаборКонстант.ОтметитьКакПрочтенноеЧерезСек	= Регламент.ОтметитьКакПрочтенноеЧерезСек();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ЗагружатьRSSПриСтарте.Доступность = Регламент.ЭтоФайловыйВариант();
КонецПроцедуры
