
Процедура ПередНачаломРаботыСистемы() Экспорт
	Попытка
		КомОбъект = Новый COMОбъект("Msxml2.XMLHTTP");
	Исключение
		Возврат;
	КонецПопытки;
		
	Если Регламент.ЗагружатьRSSПриСтарте() Тогда
		Загрузить();
	КонецЕсли;
КонецПроцедуры

Процедура ОткрытьПоСсылке(Знач Гиперссылка) Экспорт
	Если ТипЗнч(Гиперссылка) =  Тип("Строка") И НЕ ПустаяСтрока(Гиперссылка) Тогда
		ПерейтиПоНавигационнойСсылке(Гиперссылка);
		//СистемнаяИнформация = Новый СистемнаяИнформация;
		//Если Лев(СистемнаяИнформация.ТипПлатформы, 7) = "Windows" Тогда
		//	Шел = Новый COMObject("WScript.Shell");
		//	Шел.Run(Гиперссылка);
		//КонецЕсли;
	ИначеЕсли ТипЗнч(Гиперссылка) = Тип("ДокументСсылка.Публикация") Тогда
		ОткрытьПоСсылке(Гиперссылка.Гиперссылка);
	ИначеЕсли ТипЗнч(Гиперссылка) = Тип("СправочникСсылка.Авторы") Тогда
		ОткрытьПоСсылке(?(ПустаяСтрока(Гиперссылка.Код), "", "https://infostart.ru/profile/" + Гиперссылка.Код + "/"));
	КонецЕсли;
КонецПроцедуры

Процедура Загрузить(Знач Канал=Неопределено, Знач Сообщать=Ложь) Экспорт
	Итог = 0;
	Если ПустаяСтрока(Канал) Или ТипЗнч(Канал) = Тип("СправочникСсылка.Каналы") Тогда
		Итог = Инфостарт.ЗагрузитьRSS(Канал);
	ИначеЕсли ТипЗнч(Канал) = Тип("Массив") Тогда
		Для Каждого тЭлемент Из Канал Цикл
			Если ТипЗнч(тЭлемент) = Тип("СправочникСсылка.Каналы") Тогда
				Итог = Итог + Инфостарт.ЗагрузитьRSS(тЭлемент);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Сообщать Тогда
		Сообщить("Загружено сообщений: " + Строка(Итог));
	КонецЕсли;
	Если Итог > 0 Тогда
		Оповестить("ЗагрузкаRSS");
	КонецЕсли;
КонецПроцедуры
