
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Содержание.Вид = ВидПоляФормы.ПолеHTMLДокумента;
	СписокПриАктивизацииЯчейки();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ТекстУстановить(Содержание, НаКлиенте.ХТМЛ(ТекстПолучить(Параметр)));
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	Оповестить("ПубликацияПрочитано", Элементы.Список.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура Обновка()
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		
	ИначеЕсли ПустаяСтрока(Содержание.ПолучитьТекст()) Тогда
		
	ИначеЕсли ОтметитьКакПрочтенное(Элементы.Список.ТекущаяСтрока) Тогда
		Элементы.Список.Обновить();
		
		//Оповестить("ПубликацияПрочитано", Элементы.Список.ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ТекстПолучить(Знач Ссылка)
	Ответ = "";
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Публикация") Тогда
		Ответ = ?(ПустаяСтрока(Ссылка.ТекстСтатьи), Ссылка.Описание, Ссылка.ТекстСтатьи);
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Процедура ТекстУстановить(Контрол, Текст="")
	Контрол.Удалить();
	Если НЕ ПустаяСтрока(Текст) Тогда
		Контрол.УстановитьHTML(Текст, Новый Структура);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОтметитьКакПрочтенное(Знач Ссылка)
	Ответ = Ложь;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Публикация") И ЗначениеЗаполнено(Ссылка) И НЕ Ссылка.Проведен Тогда
		Док = Ссылка.ПолучитьОбъект();
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
			Ответ = Истина;
		Исключение
		КонецПопытки;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Функция ПроведенТаки(Знач Ссылка)
	Возврат ?(ТипЗнч(Ссылка) = Тип("ДокументСсылка.Публикация"), Ссылка.Проведен, Ложь);
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент=Неопределено)
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		ЭтаФорма.ОтключитьОбработчикОжидания("Обновка");
		Содержание.Удалить();
		Если Элементы.Найти("ФормаКоманднаяПанель") = Неопределено Тогда
			//Для Каждого тЭлемент Из Элементы Цикл
			//	Если тЭлемент.Видимость И ТипЗнч(тЭлемент) = Тип("ГруппаФормы") И НРег(Лев(тЭлемент.Имя, 5)) = "форма" Тогда
			//		ТекущийЭлемент = тЭлемент;
			//		Прервать;
			//	КонецЕсли;
			//КонецЦикла;
		Иначе
			ТекущийЭлемент = Элементы.ФормаКоманднаяПанель;
		КонецЕсли;
	ИначеЕсли НЕ Пионер Тогда
		Пионер = Истина;
	ИначеЕсли Элементы.Содержание.Видимость Тогда
		Если НЕ Элементы.Список.ТекущиеДанные.Свойство("Описание") Тогда
			Содержание.Удалить();
		ИначеЕсли Найти(Содержание.ПолучитьТекст(), Лев(Элементы.Список.ТекущиеДанные.Описание, 17)) = 0 Тогда
			ТекстУстановить(Содержание, НаКлиенте.ХТМЛ(ТекстПолучить(Элементы.Список.ТекущаяСтрока)));
		КонецЕсли;
		ЭтаФорма.ОбновитьОтображениеДанных(Элементы.Содержание);

		Если Элементы.Список.ТекущиеДанные.Свойство("Ссылка") И НЕ ПроведенТаки(Элементы.Список.ТекущиеДанные.Ссылка) Тогда
			Статья = Элементы.Список.ТекущиеДанные.Ссылка;
			ВремяСтарт	= ТекущаяДата();
			ЭтаФорма.ПодключитьОбработчикОжидания("Обновка", Регламент.ОтметитьКакПрочтенноеЧерезСек(), Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЭтаФорма.ОтключитьОбработчикОжидания("Обновка");
КонецПроцедуры
