
&НаСервереБезКонтекста
Функция ЭтоТакиДокумент(Знач Ссылка)
	Возврат ТипЗнч(Ссылка) = Тип("ДокументСсылка.Публикация")
		Или (ТипЗнч(Ссылка) = Тип("ДанныеФормыСтруктура") И Ссылка.Свойство("Ссылка"));
КонецФункции

&НаСервереБезКонтекста
Функция ТекстПолучить(Знач Ссылка)
	Ответ = "";
	//Если ЭтоТакиДокумент(Ссылка) Тогда
		Ответ = ?(ПустаяСтрока(Ссылка.ТекстСтатьи), Ссылка.Описание, Ссылка.ТекстСтатьи);
	//КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервереБезКонтекста
Функция ОтметитьКакПрочтенное(Знач Ссылка)
	Ответ = Ложь;
	Если НЕ ПроведенТаки(Ссылка) Тогда
		Попытка
			Док = Ссылка.ПолучитьОбъект();
			Док.Записать(РежимЗаписиДокумента.Проведение);
			Ответ = Истина;
		Исключение
		КонецПопытки;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервереБезКонтекста
Функция ПроведенТаки(Знач Ссылка)
	Возврат ?(ЭтоТакиДокумент(Ссылка), Ссылка.Проведен, Истина);
КонецФункции

&НаСервере
Процедура ТекстУстановить(Знач Ссылка)
	Содержание.Удалить();
	Если ЭтоТакиДокумент(Ссылка) Тогда
		Содержание.УстановитьHTML(Инфостарт.Причесать(ТекстПолучить(Ссылка)), Новый Структура);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Содержание.Вид = ВидПоляФормы.ПолеHTMLДокумента;
	СписокПриАктивизацииСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ТекстУстановить(Параметр);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	Оповестить("ПубликацияПрочитано", Элементы.Список.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура Обновка()
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		
	ИначеЕсли ПустаяСтрока(Содержание.ПолучитьТекст()) Тогда
		
	ИначеЕсли ОтметитьКакПрочтенное(Элементы.Список.ТекущаяСтрока) Тогда
		Элементы.Список.Обновить();
		
		Оповестить("ПубликацияПрочитано", Элементы.Список.ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЭтаФорма.ОтключитьОбработчикОжидания("Обновка");
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент=Неопределено)
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		ЭтаФорма.ОтключитьОбработчикОжидания("Обновка");
		Содержание.Удалить();
		Если Элементы.Найти("ФормаКоманднаяПанель") = Неопределено Тогда
			//Для Каждого тЭлемент Из Элементы Цикл
			//	Если тЭлемент.Видимость И ТипЗнч(тЭлемент) = Тип("ГруппаФормы") И НРег(Лев(тЭлемент.Имя, 5)) = "форма" Тогда
			//		ТекущийЭлемент = тЭлемент;
			//		Прервать;
			//	КонецЕсли;
			//КонецЦикла;
		Иначе
			ТекущийЭлемент = Элементы.ФормаКоманднаяПанель;
		КонецЕсли;
	ИначеЕсли НЕ Пионер Тогда
		Пионер = Истина;
	ИначеЕсли Элементы.Содержание.Видимость Тогда
		Если НЕ Элементы.Список.ТекущиеДанные.Свойство("Описание") Тогда
			Содержание.Удалить();
		ИначеЕсли Найти(Содержание.ПолучитьТекст(), Лев(Элементы.Список.ТекущиеДанные.Описание, 17)) = 0 Тогда
			ТекстУстановить(Элементы.Список.ТекущаяСтрока);
		КонецЕсли;
		ЭтаФорма.ОбновитьОтображениеДанных(Элементы.Содержание);
		
		Если НЕ ПроведенТаки(Элементы.Список.ТекущиеДанные) Тогда
			ЭтаФорма.ПодключитьОбработчикОжидания("Обновка", Регламент.ОтметитьКакПрочтенноеЧерезСек(), Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
