
Процедура ПередНачаломРаботыСистемы() Экспорт
	//Юзеры = ПользователиИнформационнойБазы.ПолучитьПользователей();
	//Для Каждого Юзер Из Юзеры Цикл
	//	Юзеры.Удалить(Юзер);
	//КонецЦикла;
	
	тЭлемент = Справочники.Каналы.Инфостарт.ПолучитьОбъект();
	Если тЭлемент.Парсер <> Перечисления.Парсеры.Инфостарт Или ПустаяСтрока(тЭлемент.Гиперссылка) Тогда
		тЭлемент.Парсер				= Перечисления.Парсеры.Инфостарт;
		тЭлемент.Гиперссылка		= "https://infostart.ru/print/";
		тЭлемент.ПериодОбновления	= 1;
	КонецЕсли;
	тСтрока 				= ?(тЭлемент.Гиперссылки.Количество() = 0, тЭлемент.Гиперссылки.Добавить(), тЭлемент.Гиперссылки[0]);
	Если ПустаяСтрока(тСтрока.Гиперссылка) Тогда
		тСтрока.Гиперссылка				= "https://infostart.ru/public/rss/";
	КонецЕсли;
	Если тЭлемент.Модифицированность() Тогда
		тЭлемент.Записать();
	КонецЕсли;
	Если Константы.ОтметитьКакПрочтенноеЧерезСек.Получить() = 0 Тогда
		Константы.ОтметитьКакПрочтенноеЧерезСек.Установить(ОтметитьКакПрочтенноеЧерезСек());
		Константы.ВестиПротоколЗагрузки.Установить(Истина);
	КонецЕсли;
КонецПроцедуры

Функция ЗагружатьТекстыПубликацийПриЗагрузке() Экспорт
	Возврат Константы.ЗагружатьТекстыПубликацийПриЗагрузке.Получить();
КонецФункции

Функция ОтметитьКакПрочтенноеЧерезСек() Экспорт
	Возврат ?(Константы.ОтметитьКакПрочтенноеЧерезСек.Получить() = 0, 5, Константы.ОтметитьКакПрочтенноеЧерезСек.Получить());
КонецФункции

Функция ВестиПротоколЗагрузки() Экспорт
	Возврат Константы.ВестиПротоколЗагрузки.Получить();
КонецФункции

Функция ВестиПротоколЗагрузкиПодробно() Экспорт
	Возврат Константы.ВестиПротоколЗагрузкиПодробно.Получить();
КонецФункции

Процедура ЗагрузкаRSS() Экспорт
	Если ПолучитьИспользованиеЖурналаРегистрации().Найти(УровеньЖурналаРегистрации.Информация) = Неопределено Или ПолучитьИспользованиеЖурналаРегистрации().Найти(УровеньЖурналаРегистрации.Примечание) = Неопределено Тогда
		ЗаписьЖурналаРегистрации("Загрузка RSS", , Метаданные.РегламентныеЗадания.ЗагрузкаRSS);
	КонецЕсли;
	Инфостарт.ЗагрузитьRSS();
КонецПроцедуры

Процедура ФлагиУстановить(Ссылка, Флаг=Ложь) Экспорт
	Объект = Ссылка.ПолучитьОбъект();
	Для Каждого тСтрока Из Объект.Гиперссылки Цикл
		тСтрока.Заблокировано = Флаг;
	КонецЦикла;
	Объект.Записать();
КонецПроцедуры
