
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УдалитьВсеПубликации(ПараметрКоманды);
КонецПроцедуры

&НаСервере
Процедура УдалитьВсеПубликации(Параметр)
	Доки = Документы.Публикация.Выбрать(,, Новый Структура("Канал", Параметр));
	Пока Доки.Следующий() Цикл
		Доки.ПолучитьОбъект().Удалить();
	КонецЦикла;
	Доки = РегистрыСведений.Загрузки.Выбрать(,, Новый Структура("Канал", Параметр));
	Пока Доки.Следующий() Цикл
		Доки.ПолучитьМенеджерЗаписи().Удалить();
	КонецЦикла;
КонецПроцедуры
